@extends('layouts.master')

@section('content')

    <section class="rss" style="padding: 30px 0;background-color: #FFF">
        <div class="container">

            <h1>خدمة الأخبار المباشرة</h1>
            <hr>


            <h4>
                للحصول على خدمة الاخبار المباشرة من الوكالة الوطنية للاعلام اتبع ما يلي:
            </h4>

            <table class="table table-bordered" style="font-size: 16px;">
                <thead>
                <tr>
                    <th style="width: 20%">الموضوع</th>
                    <th>الرابط</th>
                </tr>
                </thead>
                <tbody>
                <tr>
                    <td>الأخبار الرئيسية</td>
                    <td><a target="_blank" href="{{ route('feed.news')  }}">اضغط هنا</a></td>
                </tr>
                <tr>
                    <td>الفيديوهات</td>
                    <td><a target="_blank" href="{{ route('feed.videos') }}">اضغط هنا</a></td>
                </tr>
                <tr>
                    <td>المقالات</td>
                    <td><a target="_blank" href="{{ route('feed.articles') }}">اضغط هنا</a></td>
                </tr>
                @foreach($news_categories as $category)
                    <tr>
                        <td>{{ $category->name }}</td>
                        <td><a target="_blank" href="{{ route('feed.news-category', $category->id) }}">اضغط هنا</a></td>
                    </tr>
                @endforeach
                </tbody>
            </table>

            <h2>شروط الاستخدام:</h2>
            <p>


                تعتبر خدمة RSS وسيلة يقوم موقع الوكالة الوطنية للاعلام الإلكتروني من خلالها بتوفير عناوين الأخبار
                الرئيسية بصيغة XML (المستخدمة في عمليات النشر الإلكترونية والذي يضم "محتوى RSS") لزوار موقع الوكالة
                الوطنية للاعلام الذين يستخدمون قارئ RSS.
                وتحكم شروط الاستخدام هذه استعمال خدمة RSS. كما أن استخدام خدمة RSS يخضع لشروط وأحكام ""اتفاقية خدمات
                الوكالة الوطنية للاعلام التفاعلية"، التي تحكم استخدام مواقع الوكالة الوطنية للاعلام الإلكترونية، وخدمات
                المعلومات والمحتوى. وقد تقوم الوكالة الوطنية للاعلام بتغيير شروط الاستخدام هذه واتفاقية خدمة " الوكالة
                الوطنية للاعلام التفاعلية" دون إشعار مسبق.
            </p>

            <h4>ستخدام خدمة الأخبار المباشرة:</h4>
            <p>
                تعتبر خدمة RSS خدمة مجانية توفرها الوكالة الوطنية للاعلام للاستعمالات غير التجارية. ويمنع منعا باتا أي
                استخدام آخر للخدمة، بما في ذلك، دمج أي إعلانات، دون حدود، أو وضع إعلانات فيها تتعلق بمحتوى RSS أو تستهدف
                هذا المحتوى.

                ويتعين عليك استخدام مصادر أخبار RSS بحسب شروط الوكالة الوطنية للاعلام ، كما أنه لا يمكنك تغيير أو تعديل
                النص أو المحتوى أو الروابط التي توفرها الوكالة الوطنية للاعلام. للحصول على ترخيص بنشر المحتوى على الشبكة
                الإلكترونية أو إعادة طباعته أو نسخه أو ترخيص لمواد الوكالة الوطنية للاعلام، يرجى إرسال الطلب إلى العنوان
                التالي: booking@watania.ps
            </p>

            <h4>الربط إلى صفحات المحتوى:</h4>
            <p>
                يمكن استخدام خدمة RSS فقط من خلال تلك البرامج التي توفر رابطا فاعلا، الذي يقوم عند الدخول إليه، بنقل
                المستخدم مباشرة إلى مشاهدة المقال بالكامل على موقع الوكالة الوطنية للاعلام لا يمكنك مشاهدة محتوى RSS
                بطريقة لا تسمح بالربط الناجح أو التحويل أو التوصيل إلى صفحة موقع (الوكالة الوطنية للاعلام ) الملائمة.
                ولا يمكنك إدخال أي صفحة وسيطة أو صفحة لشد الانتباه أو محتوى آخر بين رابط RSS وصفحة موقع الوكالة الوطنية
                للاعلام الملائمة.
            </p>

            <h4>الملكية/النسبة:</h4>
            <p>
                تحتفظ الوكالة الوطنية للاعلام بملكية محتوى RSS والحقوق الأخرى، وأي شعار أو شعارات أخرى أو علامات تجارية
                لـ الوكالة الوطنية للاعلام مستخدمة فيما يتعلق بخدمة RSS. يجب عليك الإشارة إلى موقع الوكالة الوطنية
                للاعلام باستخدامك لمصادر أخبار RSS. في حال عزو المصدر والإشارة إليه باستخدام رسم، يجب عليك استخدام شعار
                موقع الوكالة الوطنية للاعلام المناسب الذي نستخدمه في مصادر أخبارنا عبر خدمة RSS.
            </p>

            <h4>
                الحق في وقف خدمة RSS:
            </h4>
            <p>
                تحتفظ الوكالة الوطنية للاعلام بحق وقف توفير أي من أخبارها أو كلها في أي وقت، كما تطالبك التوقف عن عرض أو
                توزيع أو استخدام، وما إلى ذلك، أي من أو كافة مصادرنا الإخبارية عبر خدمة RSS ، لأي سبب، بما في ذلك قيامك
                بانتهاكك، مهما كان حجمه، لأي شرط من شروط الاستخدام هذه. ولا تتحمل الوكالة الوطنية للاعلام أي مسؤولية
                قانونية تجاه أي من نشاطاتك فيما يتعلق بمصادر أخبار RSS أو استخدامك لخدمة RSS فيما يتعلق بموقعك
                الإلكتروني.
            </p>
        </div>
    </section>

@endsection